---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
WorksharingUtils Properties
WorksharingUtils Class See Also Send Feedback
---

The WorksharingUtils type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

# See Also

WorksharingUtils Class

Autodesk.Revit.DB Namespace